const r=`# js练习\r
\r
示例 1：\r
\`\`\`\r
输入：arr = [5, 4, 1, 2, 3], fn = (x) => x\r
输出：[1, 2, 3, 4, 5]\r
解释：fn 只是返回传入的数字，因此数组按升序排序。\r
\`\`\`\r
示例 2：\r
\`\`\`\r
输入：arr = [{"x": 1}, {"x": 0}, {"x": -1}], fn = (d) => d.x\r
输出：[{"x": -1}, {"x": 0}, {"x": 1}]\r
解释：fn 返回 "x" 键的值，因此数组根据该值排序。\r
\`\`\`\r
示例 3：\r
\`\`\`\r
输入：arr = [[3, 4], [5, 2], [10, 1]], fn = (x) => x[1]\r
输出：[[10, 1], [5, 2], [3, 4]]\r
解释：数组按照索引为 1 处的数字升序排序。\r
\`\`\`\r
\`\`\`js\r
const arr1 = [5, 4, 1, 2, 3]\r
const arr2= [{"x": 1}, {"x": 0}, {"x": -1}]\r
const arr3= [[3, 4], [5, 2], [10, 1]]\r
\r
const sortBy=(arr,fn)=>{\r
return arr.sort((a,b)=>fn(a)-fn(b))\r
}\r
\r
console.log("🚀 ~ sortBy(arr1,fn = (x) => x):", sortBy(arr1,fn = (x) => x))\r
console.log("🚀 ~ sortBy(arr1,fn = (x) => x):", sortBy(arr2,fn = (d) => d.x))\r
console.log("🚀 ~ sortBy(arr1,fn = (x) => x):", sortBy(arr3,fn = (x) => x[0]))\r
\`\`\``;export{r as default};
