const n=`# tcp-4次挥手
TCP的四次挥手是双方用来安全、可靠地终止一个已建立的TCP连接的过程

4次挥手客户端和服务端都可以主动发起，发起端有一个FIN标识

1. 第一次挥手(假设客户端发起关闭)

客户端->
- FIN
- 并随机生成一个初始序列号seq=x(客户端序列号)
->服务端

2. 客户端进入wait1(第一次等待)
等待服务端响应

服务端验证

3. 第二次挥手

服务端->
- ACK(验证成功就加上这个)
- ack=x(客户端序列号seq)+1

->客户端

4. 客户端进入wait2(第一次等待)

如果有未完成的请求或者是别的响应，在这个地方直到把所有任务都处理完成，才会进行第三次握手

5. 第三次挥手

服务端->
- FIN
- ACK(验证成功就加上这个)
- ack=x(客户端seq)+1
- seq=y(服务端序列号)

->客户端

6. 客户端超时等待(一般持续1-4分钟)
客户端发出的最后一次 ACK 报文可能在网络中丢失。
服务端（处于 LAST_ACK 状态）因为没收到 ACK，会超时并重新发送 FIN 报文。
7. 第四次挥手

客户端->
- ACK
- ack=y(服务端seq)+1 
- seq=x(客户端seq)+1 
->服务端

然后服务端就会关闭
`;export{n as default};
