const n=`# 浏览器输入url发生了什么

## 查找地址，建立连接

1. 浏览器首先需要DNS解析，把域名换成服务器的真实IP地址。这个过程会查本地缓存，不行就去找DNS服务器。
2. 拿到IP后，浏览器会发起 TCP三次握手，跟服务器建立一个可靠的连接通道。
3. 如果网址是HTTPS，在这个通道之上，还会再进行一次 TLS握手，来协商一个加密密钥，确保后续通信的安全

## 发送请求，获取数据
1. 连接打通后，浏览器会组装一个 HTTP GET请求 发过去。这个请求包里包含了用户代理、能接受的数据格式、以及之前存的Cookie等信息
2. 服务器收到请求，处理完业务逻辑（比如查询数据库），就会返回一个 HTTP响应。如果成功，状态码就是200，响应体里就是我们想要的HTML文档

## 解析渲染，展示页面
1. 它会解析HTML，生成DOM树。

2. 同时解析CSS，生成CSSOM树。

3. 把这两棵树合并成渲染树，然后计算每个元素的位置大小（布局），最后把像素画到屏幕上（绘制）。

4. 在解析过程中，如果遇到 <script> 标签，通常会暂停HTML解析，先去下载和执行JavaScript，所以我们会把JS放在页面底部或者加上 async/defer 属性来优化。


- 问DNS：“DNS解析具体步骤？答：浏览器缓存 -> 系统缓存 -> 路由器缓存 -> ISP的DNS服务器 -> 递归查询（根->顶级域->权威域）。”

- 问TCP：“为什么是三次握手？答：主要是为了防止已失效的连接请求报文突然传到服务器，导致服务器白白等待，浪费资源。”

- 问渲染：“CSS和JS为什么会阻塞？答：因为JS可能操作DOM和CSS，所以默认情况下，JS的执行必须等待它之前的CSS解析完成。而浏览器为了避免重复渲染，会等JS执行完再继续构建DOM和CSSOM。”

- 问优化：“从这个过程看，怎么优化？答：1. DNS预取。2. 减少HTTP请求（雪碧图、代码合并）。3. 使用CDN。4. 压缩资源。5. CSS放头部，JS放底部。”`;export{n as default};
